In [4]:
# How to iterate over rows in Pandas Dataframe
# Method #1: Using the DataFrame.iterrows() method

# This method iterated over the rows as (index, series) pairs.


# importing pandas
import pandas as pd
  
# list of dicts
input_df = [{'name':'Sujeet', 'age':10},
            {'name':'Sameer', 'age':11},
            {'name':'Sumit', 'age':12}]
  
df = pd.DataFrame(input_df)
print('Original DataFrame: \n', df)
  
  
print('\nRows iterated using iterrows() : ')
for index, row in df.iterrows():
    print(row['name'], row['age'])

Original DataFrame:
      name  age
0  Sujeet   10
1  Sameer   11
2   Sumit   12

Rows iterated using iterrows() :
Sujeet 10
Sameer 11
Sumit 12

Method #2: Using the DataFrame.itertuples() method

This method returns a named tuple for every row. getattr() function can be used to get the row attribute in the returned tuple. This method is faster than Method #1.

In [8]:
import pandas as pd
  
# list of dicts
input_df = [{'name':'Sujeet', 'age':10},
            {'name':'Sameer', 'age':110},
            {'name':'Sumit', 'age':120}]
  
df = pd.DataFrame(input_df)
print('Original DataFrame: \n', df)
  
print('\nRows iterated using itertuples() : ')
for row in df.itertuples():
    print(getattr(row, 'name'), getattr(row, 'age'))

Original DataFrame:
      name  age
0  Sujeet   10
1  Sameer  110
2   Sumit  120

Rows iterated using itertuples() :
Sujeet 10
Sameer 110
Sumit 120

In [9]:
#Different ways to iterate over rows in Pandas Dataframe
#M1:Using index attribute of the Datafram
data = {'Name': ['Ankit', 'Amit', 'Aishwarya', 'Priyanka'],
                'Age': [21, 19, 20, 18],
                'Stream': ['Math', 'Commerce', 'Arts', 'Biology'],
                'Percentage': [88, 92, 95, 70]}
  
# Convert the dictionary into DataFrame
df = pd.DataFrame(data, columns = ['Name', 'Age', 'Stream', 'Percentage'])
  
print("Given Dataframe :\n", df)
  
print("\nIterating over rows using index attribute :\n")
  
# iterate through each row and select 
# 'Name' and 'Stream' column respectively.
for ind in df.index:
     print(df['Name'][ind], df['Stream'][ind])

Given Dataframe :
         Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20      Arts          95
3   Priyanka   18   Biology          70

Iterating over rows using index attribute :

Ankit Math
Amit Commerce
Aishwarya Arts
Priyanka Biology

In [10]:
# M2:loc
data = {'Name': ['Ankit', 'Amit', 'Aishwarya', 'Priyanka'],
                'Age': [21, 19, 20, 18],
                'Stream': ['Math', 'Commerce', 'Arts', 'Biology'],
                'Percentage': [88, 92, 95, 70]}
  
# Convert the dictionary into DataFrame
df = pd.DataFrame(data, columns = ['Name', 'Age', 'Stream', 'Percentage'])
  
print("Given Dataframe :\n", df)
  
print("\nIterating over rows using loc function :\n")
  
# iterate through each row and select 
# 'Name' and 'Age' column respectively.
for i in range(len(df)) :
  print(df.loc[i, "Name"], df.loc[i, "Age"])

Given Dataframe :
         Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20      Arts          95
3   Priyanka   18   Biology          70

Iterating over rows using loc function :

Ankit 21
Amit 19
Aishwarya 20
Priyanka 18

In [11]:
#using iloc
for i in range(len(df)) :
  print(df.iloc[i, 0], df.iloc[i, 2])

Ankit Math
Amit Commerce
Aishwarya Arts
Priyanka Biology

In [12]:
#USING lambda
print(df.apply(lambda row: row["Name"] + " " + str(row["Percentage"]), axis = 1))

0        Ankit 88
1         Amit 92
2    Aishwarya 95
3     Priyanka 70
dtype: object

In [13]:
#Selecting rows in pandas DataFrame based on conditions
rslt_df = df[df['Percentage'] > 80]
  
rslt_df

        Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20      Arts          95

In [14]:
#using loc
rslt_df = df.loc[df['Percentage'] > 80]
  
rslt_df

        Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20      Arts          95

In [16]:
#  Selecting all the rows from the given dataframe in which ‘Stream’ is present in the options list using basic method.
options = ['Math', 'Commerce']
  
# selecting rows based on condition
rslt_df = df[df['Stream'].isin(options)]
rslt_df

    Name  Age    Stream  Percentage
0  Ankit   21      Math          88
1   Amit   19  Commerce          92

In [17]:
#using loc
rslt_df = df.loc[df['Stream'].isin(options)]
rslt_df

    Name  Age    Stream  Percentage
0  Ankit   21      Math          88
1   Amit   19  Commerce          92

In [18]:
# Selecting all the rows from the given dataframe in which ‘Stream’ is not present in the options list using .loc[].
rslt_df = df.loc[~df['Stream'].isin(options)]
rslt_df

        Name  Age   Stream  Percentage
2  Aishwarya   20     Arts          95
3   Priyanka   18  Biology          70

In [20]:
rslt_df = df[(df['Age'] == 21) &
          df['Stream'].isin(options)]
rslt_df

    Name  Age Stream  Percentage
0  Ankit   21   Math          88

In [23]:
#Select any row from a Dataframe using iloc[] and iat[] in Pandas
df = pd.DataFrame({'Date':['10/2/2011', '11/2/2011', '12/2/2011', '13/2/11'], 
                    'Event':['Music', 'Poetry', 'Theatre', 'Comedy'], 
                    'Cost':[10000, 5000, 15000, 2000]}) 
  
# Create an empty list 
Row_list =[] 
    
# Iterate over each row 
for i in range((df.shape[0])): 
    
    # Using iloc to access the values of  
    # the current row denoted by "i" 
    Row_list.append(list(df.iloc[i, :])) 
    
# Print the first 3 elements 
print(Row_list[:2]) 
print(Row_list[:3])

[['10/2/2011', 'Music', 10000], ['11/2/2011', 'Poetry', 5000]]
[['10/2/2011', 'Music', 10000], ['11/2/2011', 'Poetry', 5000], ['12/2/2011', 'Theatre', 15000]]

In [24]:
# Limited rows selection with given column in Pandas
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32], 
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']} 
    
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data) 
    
# select three rows and two columns 
print(df.loc[1:3, ['Name', 'Qualification']])

     Name Qualification
1  Princi            MA
2  Gaurav           MCA
3    Anuj           Phd

In [26]:
df

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd

In [25]:
print(df.loc[0, :] )

Name               Jai
Age                 27
Address          Delhi
Qualification      Msc
Name: 0, dtype: object

In [27]:
# Select all or some columns, one to another using .iloc
df.iloc [0:2, 1:3]

   Age Address
0   27   Delhi
1   24  Kanpur

In [30]:
# Drop rows from the dataframe based on certain condition applied on a column
df.drop(df[df['Age'] < 25].index, inplace = True)
df

   Name  Age  Address Qualification
0   Jai   27    Delhi           Msc
3  Anuj   32  Kannauj           Phd

In [45]:
df = df = pd.DataFrame({'Date':['10/2/2011', '12/2/2011', '13/2/2011', '14/2/2011'],
                    'Event':['Music', 'Poetry', 'Theatre', 'Comedy'],
                    'Cost':[10000, 5000, 15000, 2000]})

In [46]:
df

        Date    Event   Cost
0  10/2/2011    Music  10000
1  12/2/2011   Poetry   5000
2  13/2/2011  Theatre  15000
3  14/2/2011   Comedy   2000

In [47]:
#Insert row at given position in Pandas Dataframe
def Insert_row_(row_number, df, row_value):
    # Slice the upper half of the dataframe
    df1 = df[0:row_number]
    # Store the result of lower half of the dataframe
    df2 = df[row_number:]
    # Inser the row in the upper half dataframe
    df1.loc[row_number]=row_value
    # Concat the two dataframes
    df_result = pd.concat([df1, df2])
    # Reassign the index labels
    df_result.index = [*range(df_result.shape[0])]
   # Return the updated dataframe
    return df_result
# Let's create a row which we want to insert
row_number = 2
row_value = ['11/2/2011', 'Wrestling', 12000]
  
if row_number > df.index.max()+1:
    print("Invalid row_number")
else:
  
    # Let's call the function and insert the row
    # at the second position
    df = Insert_row_(2, df, row_value)
  
    # Print the updated dataframe
    print(df)

        Date      Event   Cost
0  10/2/2011      Music  10000
1  12/2/2011     Poetry   5000
2  11/2/2011  Wrestling  12000
3  13/2/2011    Theatre  15000
4  14/2/2011     Comedy   2000

C:\Users\hp\Anaconda3\lib\site-packages\pandas\core\indexing.py:670: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  iloc._setitem_with_indexer(indexer, value)

In [ ]:
# Create a list from rows in Pandas dataframe
#

In [48]:
Row_list =[]
  
# Iterate over each row
for index, rows in df.iterrows():
    # Create list for the current row
    my_list =[rows.Date, rows.Event, rows.Cost]
      
    # append the list to the final list
    Row_list.append(my_list)
print(Row_list)

[['10/2/2011', 'Music', 10000], ['12/2/2011', 'Poetry', 5000], ['11/2/2011', 'Wrestling', 12000], ['13/2/2011', 'Theatre', 15000], ['14/2/2011', 'Comedy', 2000]]

In [49]:
print(len(Row_list))

5

In [50]:
Row_list =[]
  
# Iterate over each row
for rows in df.itertuples():
    # Create list for the current row
    my_list =[rows.Date, rows.Event, rows.Cost]
      
    # append the list to the final list
    Row_list.append(my_list)
print(Row_list)

[['10/2/2011', 'Music', 10000], ['12/2/2011', 'Poetry', 5000], ['11/2/2011', 'Wrestling', 12000], ['13/2/2011', 'Theatre', 15000], ['14/2/2011', 'Comedy', 2000]]

In [51]:
#useing loc
Row_list =[]
  
# Iterate over each row
for i in range((df.shape[0])):
  
    # Using iloc to access the values of 
    # the current row denoted by "i"
    Row_list.append(list(df.iloc[i, :]))
  
print(Row_list)

[['10/2/2011', 'Music', 10000], ['12/2/2011', 'Poetry', 5000], ['11/2/2011', 'Wrestling', 12000], ['13/2/2011', 'Theatre', 15000], ['14/2/2011', 'Comedy', 2000]]

In [52]:
# Ranking Rows of Pandas DataFrame
#rank on their ratings
movies = {'Name': ['The Godfather', 'Bird Box', 'Fight Club'],
         'Year': ['1972', '2018', '1999'],
         'Rating': ['9.2', '6.8', '8.8']}
  
df = pd.DataFrame(movies)
print(df)

            Name  Year Rating
0  The Godfather  1972    9.2
1       Bird Box  2018    6.8
2     Fight Club  1999    8.8

In [53]:
df['Rating_Rank'] = df['Rating'].rank(ascending = 1)
  
# Set the index to newly created column, Rating_Rank
df = df.set_index('Rating_Rank')
print(df)

                      Name  Year Rating
Rating_Rank
3.0          The Godfather  1972    9.2
1.0               Bird Box  2018    6.8
2.0             Fight Club  1999    8.8

In [54]:
df = df.sort_index()
print(df)

                      Name  Year Rating
Rating_Rank
1.0               Bird Box  2018    6.8
2.0             Fight Club  1999    8.8
3.0          The Godfather  1972    9.2

In [55]:
#Sorting rows in pandas DataFrame
data = {'name': ['Simon', 'Marsh', 'Gaurav', 'Alex', 'Selena'], 
        'Maths': [8, 5, 6, 9, 7], 
        'Science': [7, 9, 5, 4, 7],
        'English': [7, 4, 7, 6, 8]}
  
df = pd.DataFrame(data)
  
# Sort the dataframe’s rows by Science,
# in descending order
a = df.sort_values(by ='Science', ascending = 0)

In [56]:
a

     name  Maths  Science  English
1   Marsh      5        9        4
0   Simon      8        7        7
4  Selena      7        7        8
2  Gaurav      6        5        7
3    Alex      9        4        6

In [57]:
# If you want missing values first.


import pandas as pd
  
# create dataframe
data = {'name': ['Simon', 'Marsh', 'Gaurav', 'Alex', 'Selena'], 
        'Maths': [8, 5, 6, 9, 7], 
        'Science': [7, 9, 5, 4, 7],
        'English': [7, 4, 7, 6, 8]}
df = pd.DataFrame(data)
  
  
a = df.sort_values(by ='Science', na_position ='first' )
print(a)

     name  Maths  Science  English
3    Alex      9        4        6
2  Gaurav      6        5        7
0   Simon      8        7        7
4  Selena      7        7        8
1   Marsh      5        9        4

In [58]:
#max points
dict1 ={'Driver':['Hamilton', 'Vettel', 'Raikkonen',
                  'Verstappen', 'Bottas', 'Ricciardo',
                  'Hulkenberg', 'Perez', 'Magnussen', 
                  'Sainz', 'Alonso', 'Ocon', 'Leclerc',
                  'Grosjean', 'Gasly', 'Vandoorne',
                  'Ericsson', 'Stroll', 'Hartley', 'Sirotkin'],
                    
        'Points':[408, 320, 251, 249, 247, 170, 69, 62, 56,
                   53, 50, 49, 39, 37, 29, 12, 9, 6, 4, 1],
                     
        'Age':[33, 31, 39, 21, 29, 29, 31, 28, 26, 24, 37,
                      22, 21, 32, 22, 26, 28, 20, 29, 23]}
                        
# creating dataframe using DataFrame constructor
df = pd.DataFrame(dict1)
  
# Who scored more points ?
print(df[df.Points == df.Points.max()])

     Driver  Points  Age
0  Hamilton     408   33

In [59]:
#max age
print(df.Age.max())

39

In [60]:
#Shows min on Driver, Points, Age columns.
print(df.min())

Driver    Alonso
Points         1
Age           20
dtype: object

In [61]:
# Get all rows in a Pandas DataFrame containing given substring
df = pd.DataFrame({'Name': ['Geeks', 'Peter', 'James', 'Jack', 'Lisa'],
                   'Team': ['Boston', 'Boston', 'Boston', 'Chele', 'Barse'],
                   'Position': ['PG', 'PG', 'UG', 'PG', 'UG'],
                   'Number': [3, 4, 7, 11, 5],
                   'Age': [33, 25, 34, 35, 28],
                   'Height': ['6-2', '6-4', '5-9', '6-1', '5-8'],
                   'Weight': [89, 79, 113, 78, 84],
                   'College': ['MIT', 'MIT', 'MIT', 'Stanford', 'Stanford'],
                   'Salary': [99999, 99994, 89999, 78889, 87779]},
                   index =['ind1', 'ind2', 'ind3', 'ind4', 'ind5'])
print(df, "\n")
  
print("Check PG values in Position column:\n")
df1 = df['Position'].str.contains("PG")
print(df1)

       Name    Team Position  Number  Age Height  Weight   College  Salary
ind1  Geeks  Boston       PG       3   33    6-2      89       MIT   99999
ind2  Peter  Boston       PG       4   25    6-4      79       MIT   99994
ind3  James  Boston       UG       7   34    5-9     113       MIT   89999
ind4   Jack   Chele       PG      11   35    6-1      78  Stanford   78889
ind5   Lisa   Barse       UG       5   28    5-8      84  Stanford   87779

Check PG values in Position column:

ind1     True
ind2     True
ind3    False
ind4     True
ind5    False
Name: Position, dtype: bool

In [62]:
df1 = df[df['Team'].str.contains("Boston") | df['College'].str.contains('MIT')]
print(df1)

       Name    Team Position  Number  Age Height  Weight College  Salary
ind1  Geeks  Boston       PG       3   33    6-2      89     MIT   99999
ind2  Peter  Boston       PG       4   25    6-4      79     MIT   99994
ind3  James  Boston       UG       7   34    5-9     113     MIT   89999

In [63]:
# Convert a column to row name/index in Pandas
data = {'Name':["Akash", "Geeku", "Pankaj", "Sumitra","Ramlal"],
       'Branch':["B.Tech", "MBA", "BCA", "B.Tech", "BCA"],
       'Score':["80","90","60", "30", "50"],
       'Result': ["Pass","Pass","Pass","Fail","Fail"]}
  
# creating a dataframe 
df = pd.DataFrame(data)
   
df

      Name  Branch Score Result
0    Akash  B.Tech    80   Pass
1    Geeku     MBA    90   Pass
2   Pankaj     BCA    60   Pass
3  Sumitra  B.Tech    30   Fail
4   Ramlal     BCA    50   Fail

In [64]:
df = df.set_index('Name')
  
df

         Branch Score Result
Name
Akash    B.Tech    80   Pass
Geeku       MBA    90   Pass
Pankaj      BCA    60   Pass
Sumitra  B.Tech    30   Fail
Ramlal      BCA    50   Fail

In [65]:
# set the index to 'None' via its name property
df.index.names = [None]
  
df

         Branch Score Result
Akash    B.Tech    80   Pass
Geeku       MBA    90   Pass
Pankaj      BCA    60   Pass
Sumitra  B.Tech    30   Fail
Ramlal      BCA    50   Fail

In [71]:
data = {'name':["Akash", "Geeku", "Pankaj", "Sumitra", "Ramlal"],
       'Branch':["B.Tech", "MBA", "BCA", "B.Tech", "BCA"],
       'Score':["80", "90", "60", "30", "50"],
       'Result': ["Pass", "Pass", "Pass", "Fail", "Fail"]}
  
df = pd.DataFrame(data)
  
df

      name  Branch Score Result
0    Akash  B.Tech    80   Pass
1    Geeku     MBA    90   Pass
2   Pankaj     BCA    60   Pass
3  Sumitra  B.Tech    30   Fail
4   Ramlal     BCA    50   Fail

In [73]:
# pivoting the dataframe
df1=df.pivot(index ='Result', columns ='name')
  
df1

        Branch                             Score
name     Akash Geeku Pankaj Ramlal Sumitra Akash Geeku Pankaj Ramlal Sumitra
Result
Fail       NaN   NaN    NaN    BCA  B.Tech   NaN   NaN    NaN     50      30
Pass    B.Tech   MBA    BCA    NaN     NaN    80    90     60    NaN     NaN

In [75]:
# How to randomly select rows from Pandas DataFrame
df.sample()

      name  Branch Score Result
3  Sumitra  B.Tech    30   Fail

In [76]:
df.sample(n = 3)

      name  Branch Score Result
4   Ramlal     BCA    50   Fail
2   Pankaj     BCA    60   Pass
3  Sumitra  B.Tech    30   Fail

In [77]:
# here you get .50 % of the rows
df.sample(frac = 0.5)

    name  Branch Score Result
1  Geeku     MBA    90   Pass
0  Akash  B.Tech    80   Pass

In [78]:
# fraction of rows
 
# here you get 70 % row from the df
# make put into another dataframe df1
df1 = df.sample(frac =.7)
 
# Now select 50 % rows from df1
df1.sample(frac =.50)

      name  Branch Score Result
0    Akash  B.Tech    80   Pass
3  Sumitra  B.Tech    30   Fail

In [79]:
# Using NumPy
# Numpy chose how many index include for random selection and we can allow replacement.
chosen_idx = np.random.choice(4, replace = True, size = 6)
 
df2 = df.iloc[chosen_idx]
 
df2

      name  Branch Score Result
3  Sumitra  B.Tech    30   Fail
1    Geeku     MBA    90   Pass
3  Sumitra  B.Tech    30   Fail
1    Geeku     MBA    90   Pass
0    Akash  B.Tech    80   Pass
3  Sumitra  B.Tech    30   Fail